20230513113008-serotonin_and_learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-10 Fr 13:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>serotonin-and-learning</title>
<meta name="author" content="Hugs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="stylesheet.css"
</head>
<body>
<div id="preamble" class="status">
<!-- MailerLite Universal -->
<script>
    (function(w,d,e,u,f,l,n){w[f]=w[f]||function(){(w[f].q=w[f].q||[])
    .push(arguments);},l=d.createElement(e),l.async=1,l.src=u,
    n=d.getElementsByTagName(e)[0],n.parentNode.insertBefore(l,n);})
    (window,document,'script','https://assets.mailerlite.com/js/universal.js','ml');
    ml('account', '919123');
</script>
<!-- End MailerLite Universal -->
</div>
<div id="content" class="content">
<h1 class="title">serotonin-and-learning</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgca68858">Synaptic plasticity</a>
<ul>
<li><a href="#orgf864ba2">Hebbian plasticity</a></li>
<li><a href="#org56acccc">Third factors</a></li>
</ul>
</li>
<li><a href="#orgb6a8ce8"></a></li>
<li><a href="#orgc73020c">Serotonin in plasticity</a></li>
<li><a href="#org3799446">Learning and unlearning depression</a></li>
<li><a href="#org66d3d3d">key takeaways</a></li>
</ul>
</div>
</div>
<p>
Serotonin plays a role in the process of learning.
Exactly what role is not clear, but it seems to be especially involved with un-learning and re-learning.
Learning happens in the brain by changing the strength of connections between neurons (and other stuff too, but connections are a major one).
This is called synaptic plasticity.
</p>

<div id="outline-container-orgca68858" class="outline-2">
<h2 id="orgca68858">Synaptic plasticity</h2>
<div class="outline-text-2" id="text-orgca68858">
<p>
The way neurons are connected to one another isn't set in stone.
Recall that the locations where neurons signal to one another are called synapses.
The strength of the effects of these synapses can change over time, and sometimes synapses disappear or new synapses grow.
</p>

<p>
These changes are thought to be how animals learn:
</p>
<ul class="org-ul">
<li>lived experiences cause the neurons to fire in particular patterns</li>
<li>the synapses change in response to these patterns (and potentially in response to other things too)</li>
</ul>
</div>


<div id="outline-container-orgf864ba2" class="outline-3">
<h3 id="orgf864ba2">Hebbian plasticity</h3>
<div class="outline-text-3" id="text-orgf864ba2">
<p>
The most common form of plasticity in the brain is called <a href="20240405191551-hebbian_plasticity.html#ID-14baaec1-d68e-4fab-88a0-8e51986e4499">'Hebbian</a>', after Donald Hebb who hypothesized it in 1949.
When one neuron releases the neurotransmitter glutamate onto another neuron, most of the time this has the effect of bringing that neuron closer to releasing a neurotransmitter itself.
You can see it as one neuron telling another to speak up.
</p>

<p>
When this works - one neuron releases glutamate to another, and then that neuron releases its neurotransmitter, the connection between them tends to strengthen.
Otherwise, it tends to weaken.
This is often remembered as 'cells that fire together wire together', and conversely: 'fire out of sync, lose your link'.
So the strength of the connection is affected by the presynaptic activity and the postsynaptic activity.
</p>

<p>
Hebbian plasticity can explain a great deal about how stimuli (sights, sounds, etc.) are efficiently encoded by the brain.
It can also enable the efficient storage and retrieval of memories, and build associations between things.
</p>
</div>
</div>

<div id="outline-container-org56acccc" class="outline-3">
<h3 id="org56acccc">Third factors</h3>
<div class="outline-text-3" id="text-org56acccc">
<p>
We know from efforts to apply hebbian plasticity to AI that it only gets you so far.
Not all stimuli are equally important to encode, not all associations are important, and not everything should be a memory.
Those hebbian plasticity rules based on the activity of the two cells can be affected by other factors.
One way the brain does this is through the release of different neurotransmitters, such as dopamine, ephinephrine, and our good friend serotonin.
</p>

<p>
We are only just beginning to explore the immense complexity of these effects: in fact, for serotonin I was only able to find one study, on one type of cell expressing a specific serotonin receptor regarding how it changes plasticity at this level.
</p>

<p>
Ordinarily, when you make one cell spike (release neurotransmitter), and then make a cell it is connected to spike, the connection between them strengthns.
<a href="https://www.cell.com/neuron/fulltext/S0896-6273(15)00826-0">The paper</a> showed that when the cells they studied were sprayed with serotonin afterwards, this effect was reversed.
This actually matches quite nicely with some behavioral experiments I've read about.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb6a8ce8" class="outline-2">
<h2 id="orgb6a8ce8"></h2>
</div>



<div id="outline-container-orgc73020c" class="outline-2">
<h2 id="orgc73020c">Serotonin in plasticity</h2>
<div class="outline-text-2" id="text-orgc73020c">
<p>
Various studies show effects of altering serotoninergic activity on the process of plasticity.
</p>

<p>
A common method for assessing the plasticity of a mammal's cortex is to cover one eye and assess how the responses in its visual cortex change in response to this.
The visual cortex is a region of the brain which processes what is seen by the eyes - so if you cover one eye you change the kind of input this region is recieving.
The covered eye is signaling nothing - so in time the visual cortex should learn to take its cues only from the uncovered eye.
In young animals this happens quite readily, but in adults it takes much longer.
</p>

<p>
This method has been used to look at how serotonin affects plasticity.
It turns out that when you deprive young animals of serotonin, their visual cortex does not learn to only respond to the open eye (Gu and Singer 1995, Bradley et al. 1987).
Conversely, when you increase the amount of serotonin in the cortex by adiministering an SSRI, adult visual cortex learns more similarly to a young one (Vetencourt et al. 2011).
</p>

<p>
Since plasticity is learning, another important way of studying it is of course by observing the capacity of a test subject to learn a task.
Hence, a second kind of experiment on plasticity is called <a href="20240203100607-reversal_learning.html#ID-a13dcc9a-91d5-46a1-aa2b-4c960626f1f7">reversal learning.</a>
In a reversal learning experiment subjects are first taught to do things one way, and once they get the hang of it they have to learn to do the exact opposite.
It is seen as a way to measure cognitive flexibility.
One way to try and relate these learning tasks to the underlying biology is to genetically or pharmacologically alter animals and see how it affects their performance.
</p>

<p>
Recall from  <a href="20230301082956-the_serotonin_deficiency_theory.html#ID-9c8961f2-4dbd-4dc9-9cd5-f498abc8afaa">the-serotonin-deficiency-theory</a> that the serotonin transporter SERT is responsible for moving serotinin back into the cell that emitted it.
Reducing the activity of SERT will make it so that serotonin released from your neurons lingers for longer and will be more likely to affect nearby neurons.
<a href="https://academic.oup.com/cercor/article/20/8/1955/40590977">Brigman et al. 2010</a> Found that when you either genetically or chemically reduced the activity of SERT in mice, they more quickly learn to reverse their task.
</p>

<p>
A third way that plasticity is studied involves attaching glass pipettes to neurons in a slice of brain tissue for manipulating and recording their electrical potential.
A basic approach is to attach a pipette to one neuron, attach a pipette to another, then stimulate the first cell to see if it causes a change in the potential of the second.
If so, the first cell is connected to the second and that connection can be studied.
You can record the strength of the effect the first cell has on the second, then stimulate both cells to make them fire in particular patterns, and then record the strength of the connection again.
<a href="https://www.cmor-faculty.rice.edu/~caam415/lec_gab/g4/markram_etal98.pdf">In the 90s, Henry Markram used this method extensively</a> to study hebbian plasticity in cells.
Making the first cell spike and the second soon after generally strengthens the connection.
Making the second cell spike and the first soon after generally weakens the conection.
This is called Spike-timing dependent plasticity and is a fairly straightforward way for hebbian learning to be implemented.
One experiment suggests that serotonin may turn this on its head.
</p>

<p>
<a href="https://www.cell.com/neuron/fulltext/S0896-6273(15)00826-0">A paper from 2015</a> (which I found via <a href="https://pubmed.ncbi.nlm.nih.gov/30108488/">this excellent review </a>) found  that if you make the postsynaptic cell spike right after the presynaptic but spray a little serotonin on it the connection actually gets weaker instead of stronger.
It's just one paper studying one interaction in one brain region in one species of animal so almost any broader statement on the basis of it is highly speculative.
It is consistent however with a possibility I have been thinking about for a while.
</p>
</div>
</div>

<div id="outline-container-org3799446" class="outline-2">
<h2 id="org3799446">Learning and unlearning depression</h2>
<div class="outline-text-2" id="text-org3799446">
<p>
These are a few choice examples from the <a href="20240203094554-serotonin_specifically_influences_unlearning.html#ID-aab01968-25fd-4714-8016-682095ad0f43">growing list</a> of studies I've found indicating that serotonin specifically plays a role in un-learning.
It enhances plasticity by allowing the subject to change existing patterns.
It has been <a href="https://www.sciencedirect.com/science/article/pii/S0306453010002301?casa_token=zMNJ58V1W_AAAAAA:JW9cxCqnS68UxW_iE5ArLB8xd3DwfBQO5rCX6JokorIt7cfIkDYxzdU414Qbf0_k9lJSipTuXg">suggested</a> that this effect of serotonin is responsible for the antidepressant effects of SSRIs, but also that it may be important for the development of depression in the first place.
By enhancing the ability to change the way you think, SSRIs can help you break out of unhealthy cognitive habits.
We also have some evidence that serotonin plays a role in getting depressed in the first place.
</p>

<p>
Considering what we know about <a href="20230301083111-serotonin_and_heplessness.html#ID-02504069-e1e7-43c8-a746-43ed27a2f807">serotonin-and-heplessness</a>, the un-learning capabilities of serotonin could well play a role in animals un-learning the ability to respond to a situation, and thereby make way for helplessness.
If you take some action, but it turns out to be no use, then serotonin is released and weakens the connections that led to that action.
I personally consider this a more compelling explanation for learned helplessness than the sensitization of the DRN <a href="https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4920136/">suggested</a> by Maier and Seligman.
</p>
</div>
</div>

<div id="outline-container-org66d3d3d" class="outline-2">
<h2 id="org66d3d3d">key takeaways</h2>
<div class="outline-text-2" id="text-org66d3d3d">
<ul class="org-ul">
<li>When you learn, the the connections between neurons change - those that activate at the same time get stronger connections, the rest weaker</li>
<li>Serotonin appears to affect this specifically by reversing it - allowing you to un-learn and hereby re-learn more easily</li>
<li>This could explain the role it plays in both the development and recovery from depression</li>
</ul>



<p>
<a href="https://www.researchgate.net/profile/Povilas-Karvelis/publication/359631505_A_Computational_Model_of_Hopelessness_and_Active-Escape_Bias_in_Suicidality/links/6247046d7931cc7ccf0bb4fa/A-Computational-Model-of-Hopelessness-and-Active-Escape-Bias-in-Suicidality.pdf?_sg%5B0%5D=started_experiment_milestone&amp;origin=journalDetail&amp;_rtd=e30%3D">https://www.researchgate.net/profile/Povilas-Karvelis/publication/359631505_A_Computational_Model_of_Hopelessness_and_Active-Escape_Bias_in_Suicidality/links/6247046d7931cc7ccf0bb4fa/A-Computational-Model-of-Hopelessness-and-Active-Escape-Bias-in-Suicidality.pdf?_sg%5B0%5D=started_experiment_milestone&amp;origin=journalDetail&amp;_rtd=e30%3D</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="ml-embedded" data-form="UcmPfz"></div>
       <script src="https://utteranc.es/client.js"
        repo="HDictus/HDictus.github.io"
        issue-term="title"
        theme="github-light"
        crossorigin="anonymous"
        async>
      </script>

      <a href="index.html"> home </a>
</div>
</body>
</html>